{
  "timestamp": 1761616931.838167,
  "mnemonics": [
    {
      "korean_word": "슬프다",
      "romanization": "seulpeuda",
      "meaning": "to be sad",
      "mnemonic": "Sull-puh-duh sounds like Sulky puddle—imagine a sad, sulky face reflected in a rain puddle, with raindrops falling like tears.",
      "visual": "Picture yourself walking alone in the rain, seeing your sulky reflection in a puddle, feeling the sadness of a dramatic moment.",
      "notes": "The word itself sounds like you’re sighing—'seul-peu-da'—just like someone letting out a sad breath!"
    },
    {
      "korean_word": "동생",
      "romanization": "dongsaeng",
      "meaning": "younger sibling",
      "mnemonic": "Dong-saeng sounds like Dong’s song—imagine your little sibling, Dong, singing a cute, off-key song while following you around.",
      "visual": "Picture a tiny Dong belting out a silly song, tugging at your sleeve, and you can’t help but smile (even if they’re annoying).",
      "notes": "The word feels lively, just like a younger sibling’s energy!"
    },
    {
      "korean_word": "울다",
      "romanization": "ulda",
      "meaning": "to cry",
      "mnemonic": "Ool-dah sounds like You’ll daub—imagine someone crying so hard they’re dabbing (or daubing) their tears away with a tissue, leaving smudged mascara everywhere.",
      "visual": "Think of a dramatic K-drama scene where the heroine is crying, frantically daubing her tears with a crumpled tissue, yelling, 'You’ll see how sad I am!'",
      "notes": "The word even sounds like a sniffly 'uh-uh' between sobs!"
    },
    {
      "korean_word": "눈물",
      "romanization": "nunmul",
      "meaning": "tear (as in crying)",
      "mnemonic": "Noon-mool sounds like Noon mud—imagine someone crying so hard at noon that their tears mix with mud, creating little tear-mud puddles on their face.",
      "visual": "Picture a sad cartoon character standing under the midday sun, tears dripping down and turning into muddy streaks because they’ve been crying in a dusty field.",
      "notes": "The word sounds like someone saying 'Noon... mud...' while dramatically pointing at their tear-streaked face."
    },
    {
      "korean_word": "수영",
      "romanization": "suyeong",
      "meaning": "swimming",
      "mnemonic": "Soo-young sounds like Sue’s young—imagine a young Sue cannonballing into a pool, yelling 'WHEEE!' as she splashes everyone.",
      "visual": "Picture Sue, a fearless little kid, dog-paddling like a champ, her floaties barely keeping her afloat as she kicks up a storm in the water.",
      "notes": "The word even sounds like the 'swoosh' of water as she swims by!"
    },
    {
      "korean_word": "수건",
      "romanization": "sugeon",
      "meaning": "towel",
      "mnemonic": "Soo-guhn sounds like Sue’s gone—imagine Sue disappearing after her swim, but she left her towel behind, draped over a chair like a ghostly reminder.",
      "visual": "Picture a poolside scene: an empty lounge chair, a half-melted popsicle, and a towel with 'Property of Sue' embroidered on it, flapping in the breeze.",
      "notes": "The word sounds like someone sighing, 'Sue’s goooone... but her towel’s still here.'"
    },
    {
      "korean_word": "가게",
      "romanization": "gage",
      "meaning": "store",
      "mnemonic": "Gah-geh sounds like Got game?—imagine a flashy storefront with a neon sign that says 'Got game?' and sells everything from snacks to sneakers.",
      "visual": "Picture a hip street vendor outside the store, yelling 'Hey, you! Got game? Come check out my stuff!' while juggling basketballs and energy drinks.",
      "notes": "The word even sounds like the 'ka-ching!' of a cash register—'ga-ge'—as you buy all the coolest gear."
    },
    {
      "korean_word": "돈",
      "romanization": "don",
      "meaning": "money",
      "mnemonic": "Dohn sounds like Dough-nut—imagine a stack of crisp bills shaped like a giant, golden donut, and every time you spend it, you take a delicious bite.",
      "visual": "Picture Scrooge McDuck diving into a pool of donut-shaped coins, yelling 'I love my dough-nut money!'",
      "notes": "The word sounds like the 'cha-ching' of a cash register—'dohn!'—when you drop coins into it."
    },
    {
      "korean_word": "빌리다",
      "romanization": "billida",
      "meaning": "to borrow",
      "mnemonic": "Bee-lee-dah sounds like Bee-leech-da—imagine a sneaky bee (your friend) leeching off you, borrowing your honey (or your last 10 bucks) and promising to pay you back 'next week.'",
      "visual": "Picture a cartoon bee in sunglasses, holding a tiny IOU note, buzzing away with your wallet while you shout, 'Hey! That’s my honey—er, money!'",
      "notes": "The word sounds like the 'bzzz' of a bee flying off with your cash!"
    },
    {
      "korean_word": "비누",
      "romanization": "binu",
      "meaning": "soap",
      "mnemonic": "Bee-noo sounds like Bee new—imagine a brand-new bar of soap shaped like a bee, sudsing up in your hands and humming 'I’m bee-new, squeaky clean!'",
      "visual": "Picture a shiny, unwrapped bee-soap sitting on your sink, its little antennae made of bubbles, ready to scrub away your sins (or just your dirt).",
      "notes": "The word sounds like the 'bzzz' of a bee combined with the 'oooh' of fresh, clean suds!"
    },
    {
      "korean_word": "차갑다",
      "romanization": "chagapda",
      "meaning": "to be cold",
      "mnemonic": "Cha-gap-da sounds like Car gap, dah!—imagine stepping out of a warm car into freezing air, and the cold hits you so hard you yell, 'Dah! There’s a gap in my jacket!'",
      "visual": "Picture yourself shivering in a parking lot, your breath visible, desperately trying to button up your coat over a giant hole while your car’s heater mocks you from inside.",
      "notes": "The word sounds like the 'ch-ch-ch' of your teeth chattering!"
    },
    {
      "korean_word": "어깨",
      "romanization": "eokkae",
      "meaning": "shoulder",
      "mnemonic": "Uh-kkae sounds like Uh, carry!—imagine someone tapping your shoulder and saying, 'Uh, can you carry this for me?' as they dump a heavy backpack onto your shoulders.",
      "visual": "Picture a friend slinging an oversized bag onto your shoulder, and you wobble like, 'Dude, my shoulders aren’t a luggage rack!'",
      "notes": "The word sounds like the 'uh-oh' you say when your shoulder starts aching!"
    },
    {
      "korean_word": "힘",
      "romanization": "him",
      "meaning": "strength",
      "mnemonic": "Heem sounds like Him!—imagine pointing at a superhero (or a buff gym rat) and yelling 'Him! That’s the guy with all the strength!' as they effortlessly lift a car over their head.",
      "visual": "Picture The Rock (or your favorite strong character) flexing, veins popping, while a crowd chants 'Him! Him! Him!' like it’s a wrestling match.",
      "notes": "The word sounds like the 'hngh!' grunt you make when lifting something heavy!"
    },
    {
      "korean_word": "가르치다",
      "romanization": "gareuchida",
      "meaning": "to teach",
      "mnemonic": "Gah-reu-chi-da sounds like Car-chi-da—imagine a driving instructor (or your patient friend) teaching you how to parallel park, yelling 'Car! Chi! Dah! Turn the wheel, dah!' as you nervously stall the engine.",
      "visual": "Picture a tiny, overly enthusiastic teacher standing on your car’s dashboard, using a pointer stick to show you which pedal is the gas.",
      "notes": "The word sounds like the 'vroom' of the car mixed with the 'aha!' moment when the lesson clicks!"
    },
    {
      "korean_word": "내일",
      "romanization": "naeil",
      "meaning": "tomorrow",
      "mnemonic": "Nae-il sounds like Nay, ill!—imagine today-you groaning, 'Nay, I’m ill!' while dragging yourself to bed, but tomorrow-you pops up fresh, yelling 'I’m cured! New day, new me!'",
      "visual": "Picture your future self high-fiving you from a calendar page, wearing sunglasses and holding a 'Tomorrow’s Gonna Be Awesome' sign.",
      "notes": "The word sounds like the 'nyeh-heh-heh' evil laugh of procrastination!"
    },
    {
      "korean_word": "친하다",
      "romanization": "chinhada",
      "meaning": "to be close/friendly",
      "mnemonic": "Cheen-ha-da sounds like Cheese-n-hug, dah!—imagine two best friends taking a selfie, squishing their cheeks together, yelling 'Cheese!' and then immediately pulling each other into a giant hug.",
      "visual": "Picture a group chat notification: 'Cheese-n-hug club meeting at 8 PM! Bring snacks and your BFF!'",
      "notes": "The word sounds like the 'squeee!' of a tight hug!"
    },
    {
      "korean_word": "쓰다",
      "romanization": "sseuda",
      "meaning": "to write",
      "mnemonic": "Sseu-da sounds like Sue-draw!—imagine your friend Sue dramatically scribbling a love letter, then sliding it across the table like 'Ta-da! I wrote this for you!'",
      "visual": "Picture Sue with a feather pen, ink smudged on her nose, crossing out mistakes and blowing on the paper like it’s a masterpiece.",
      "notes": "The word sounds like the 'scratch-scratch' of a pen on paper!"
    },
    {
      "korean_word": "받다",
      "romanization": "batda",
      "meaning": "to receive",
      "mnemonic": "Bat-da sounds like Bat—dah!—imagine someone tossing you a baseball, and you catch it in your glove with a satisfying 'Dah!' (the sound of the ball smacking leather).",
      "visual": "Picture a postal worker throwing a package at you like a fastball, and you snag it one-handed, nodding like 'Yeah, I receive.'",
      "notes": "The word sounds like the 'thwack' of the catch!"
    },
    {
      "korean_word": "강아지",
      "romanization": "gang-aji",
      "meaning": "puppy",
      "mnemonic": "Gang-ah-jee sounds like Gangster baby!—imagine a tiny, adorable puppy wearing a teeny bandana, strutting around like a mob boss, barking orders at bigger dogs.",
      "visual": "Picture this puppy sitting in a miniature leather chair, chewing on a cigar (it’s a stick), with a sign that says 'The Godpuppy.'",
      "notes": "The word sounds like the 'yip-yip' of a pup demanding treats!"
    },
    {
      "korean_word": "기쁘다",
      "romanization": "gippeuda",
      "meaning": "to be happy",
      "mnemonic": "Gee-ppuh-da sounds like Glee puh-dah!—imagine the cast of Glee suddenly bursting into song and dance in your living room, flinging confetti and yelling 'Puh-dah! Happiness attack!'",
      "visual": "Picture yourself in the middle of a flash mob, surrounded by smiling strangers high-fiving you with glittery hands.",
      "notes": "The word sounds like the 'hee-hee' of uncontrollable giggles!"
    },
    {
      "korean_word": "선물",
      "romanization": "seonmul",
      "meaning": "gift",
      "mnemonic": "Sun-mool sounds like Sun mule—imagine a mule (or a donkey in sunglasses) trotting up to you on a sunny beach, its saddlebags stuffed with perfectly wrapped presents, saying 'Here’s your gift, dude!'",
      "visual": "Picture the mule kicking up sand as it delivers a mystery box tied with a bow, and you’re like, 'A gift? From a beach mule? Best. Day. Ever.'",
      "notes": "The word sounds like the 'ta-da!' of unwrapping something amazing!"
    }
  ]
}